const urlParams = new URLSearchParams(window.location.search);
const id = urlParams.get("newsId");
const title = document.getElementById("news-page-title");
const description = document.getElementById("news-page-description");
const photo = document.getElementById("news-page-photo");
const path = "../../Assets/" + id + ".jpeg";

const News = {
    news1 : {
        title : "ለተለያዩ የማህበራዊ ሚዲያ አካዉንቶች የምንጠቀማቸዉን ይለፍ-ቃሎችን ደህንነት ማረጋገጥ ለምን አስፈላጊ ሆነ?",
        description : `ጠንካራ የይለፍ ቃሎችን #password  አለመጠቀምና የይለፍ ቃሎቻችንን ለሌሎች ማጋራት ለማንነት ስርቆትና መሰል የሳይበር ጥቃቶች እንድንጋለጥ ያደርገናል።  በመሆኑም ለተለያዩ የማህበራዊ ሚዲያ አካዉንቶች የምንጠቀማቸዉን  የይለፍ-ቃሎች ጠንካራ ማድረግና ለሌሎች አለማጋራት የሚከተሉት ጥቅሞች አሉት፡

                    👉ሚስጥራዊ መረጃዎቻችንን ደህንነት ለማረጋገጥ፤

                    👉የማንነት ስርቆት እንዳይደርስብን፤

                    👉የገንዘብ ስርቆት እና ኪሳራን ለመከላከል፤

                    👉የስም ማጣፋት ሰለባ እንዳንሆን፤ 

                    👉ከተፈቀደለት አካል ዉጪ መረጃዎችን አክሰስ #access እንዳያደርጉ፤ `,
        photo : `${path}`,
    },

    news2 : {
        title : "በአዲስ አበባ ከ55 ሺ በላይ ዜጎች የኮደርስ ሥልጠና አጠናቅቀዋል- የኢኖቬሽን እና ቴክኖሎጂ ልማት ቢሮ ",
        description : `በአዲስ አበባ ከተማ እስካሁን ድረስ 55 ሺ 886 ዜጎች የኮደርስ ሥልጠና ተከታትለው በማጠናቀቅ ዓለም አቀፍ እውቅና ያለው ሰርትፊኬት መውሰዳቸውን የአዲስ አበባ ከተማ ኢኖቬሽን እና ቴክኖሎጂ ልማት ቢሮ ኃላፊ ኢንጂነር ሰለሞን አማረ ተናግረዋል፡፡

                    ጠቅላይ ሚኒስት ዐቢይ አሕመድ (ዶ/ር) የ5 ሚሊዮን ኮደርስ ነፃ የሥልጠና መርሀግብርን ሐምሌ 16 ቀን 2016 ዓ.ም  ማስጀመራቸው ይታወሳል፡፡

                    በመርሀግብሩ  ከ2017 ዓ.ም  እስከ 2019 ዓ.ም ድረስ 5 ሚሊዮን ኮደሮችን ለማምረት ግብ ተጥሎ እየተሠራበት ይገኛል፡፡

                    በአዲስ አበባ ከተማም በሶስት ዓመታት ውስጥ 300 ሺ ዜጎች ሥልጠናውን እንደሚወስዱ ዕቅድ ተይዞ ወደ ተግባር መገባቱን ኤኤምኤን ዲጂታል ያነጋገራቸው የአዲስ አበባ ከተማ ኢኖቬሽን እና ቴክኖሎጂ ልማት ቢሮ ኃላፊ ኢንጂነር ሰለሞን አማረ ገልጸዋል፡፡

                    በተያዘው 2017 ዓ.ም  ደግሞ 75 ሺ ሰልጣኞችን ለማስመረቅ እየተሠራ ነው ብለዋል፡፡ ሥልጠናው በዳታ ሳይንስ፣ አንድሮይድ ፣ አርቲፊሻል ኢንተለጀንስ እና በፕሮግራሚንግ ዘርፎች ላይ ያተኮረ መሆኑንም ኃላፊው አስረድተዋል፡፡ 

                    እስካሁን በፕሮግራሚንግ ዘርፍ ከ40ሺ በላይ፣ በዳታ አናሊሲስ ከ51 ሺ በላይ ሰዎች፣ በአንድሮይድ ልማት 49ሺ ሰዎች እና በአርቲፊሻል ኢንተለጀንስ 18ሺ 489 ሰዎች እየተሳተፉ ሲሆን በጥቀሉ 165ሺ 99 ሰዎች በአዲስ አበባ ደረጃ ሥልጠናውን እየተከታተሉ ይገኛሉ ነው ያሉት፡፡

                    ሥልጠናውን ከሚወስዱ 165ሺ 99 ሰዎች መካከል እስከ የካቲት ድረስ  55ሺ 886 ዜጎች ሥልጠናውን በሚገባ ተከታትለው የመውጫ ፈተና በማለፍ ዓለም አቀፍ እውቅና ያለው ሰርተፍኬት ማግኘታቸውን አስታውቀዋል፡፡

                    እስከ ሰኔ ወር ድረስ 20ሺ ገደማ የሚሆኑ ሰልጣኞች ሰርተፍኬት እንደሚወስዱ ይጠበቃልም ብለዋል፡፡ 

                    ሰርተፊኬቱን የወሰዱ ወጣቶችም ያገኙትን እውቀት ወደ ተግባር እየቀየሩ እንደሚገኙ ነው የገለጹት፡፡

                    በአዲስ አበባ ካለው የተሻለ የኢንተርኔት አማራጭ እና የተማረ የሰው ኃይል አንፃር ሥልጠና እየተከታተለ ያለው ሰው በቂ አለመሆኑንም አንስተዋል፡፡ ይህም ከግንዛቤ እጥረት አንፃር የተፈጠረ ሊሆን እንደሚችል ገልጸው በቀጣይ ግንዛቤ የመፍጠሩ ሥራ ተጠናክሮ ይቀጥላል ብለዋል፡፡

                    የኢትዮ ኮደርስ ፕሮግራም ወጣቶችን ለማብቃት፣ ፈጠራን ለማጎልበት እና የዲጂታል ዘመንን ዕድል ለመጠቀም አጋዥ ሲሆን የዲጂታል ኢትዮጵያ ጉዞን ለማረጋገጥም ወሳኝነት ያለው መሆኑ ተመላክቷል፡፡`,
        photo : `${path}`,
    },

    news3 : {
        title : "በዲፕፌክ አማካኝነት በተቀናበሩ ሀሰተኛ ይዘቶች ምክንያት ብዙዎች ተጭበርብረዋል፡፡ ",
        description : "በዲፕፌክ አማካኝነት የተሰሩ ቅንብሮችን ለመለየት ተከታዮቹ የአርቲፊሻል ኢንተለጀንስ መተግበሪያዎች  ተመራጭ ናቸው፡፡",
        photo : `${path}`,
    },

    news4 : {
        title : "የተሰጠንን ተልዕኮ በብቃት በመወጣት የማህበረሰባችንን ተጠቃሚነት እናረጋግጣለን !!",
        description : "የልደታ ክ/ከተማ ምክር ቤት በ2017 በጀት ዓመት በመጀመሪያው 6 ወራት ምዘና ውጤታማ አፈፃፀም ላስመዘገቡ ተቋማት እውቅና ሰጠ። ይህ ውጤት እንድመጣ ለደከማችሁ የፅ/ቤታችን ባለሞያዎችና ከጎናችን ሆናችሁ የደገፋቹን በሙሉ በፅ/ቤታችን ስም ላቅ ያለ ምስጋና አለን!",
        photo : `${path}`,
    },

}


title.innerText = News[id].title;
description.innerText = News[id].description;
photo.style.backgroundColor = "transparent"
photo.style.backgroundImage = `url(${News[id].photo})`;



